Repository: Diablo-Loc/MaxFlowTransport
Catalog: source/src/Localization/Strings.*.resx
Languages: vi

# BtnAddEdge
source: Add Edge
vi: Thêm cạnh

# BtnAddNode
source: Add Node
vi: Thêm nút

# BtnClear
source: Clear
vi: Xóa toàn bộ

# BtnCreat
source: Creat
vi: Tạo bảng

# BtnEditEdge
source: Edit Edge
vi: Chỉnh cạnh

# BtnEraseEdge
source: Erase Edge
vi: Xóa cạnh

# BtnEraseNode
source: Erase Node
vi: Xóa nút

# BtnHideInput
source: Hide Input
vi: Ẩn phần nhập liệu

# BtnRun
source: Run
vi: Chạy thuật toán

# BtnSelect
source: Select
vi: Chọn

# BtnSelectSink
source: Select Sink(s)
vi: chọn nút bồn

# BtnSelectSource
source: Select Source(s)
vi: chọn nút nguồn

# BtnShowInput
source: Show Input
vi: Hiện phần nhập liệu

# LabelChooseTest
source: Choose Test Case:
vi: Chọn bộ dữ liệu kiểm thử:

# LabelDemand
source: Demand
vi: Cầu

# LabelInput
source: INPUT
vi: NHẬP LIỆU

# LabelLanguage
source: Language
vi: Ngôn ngữ

# LabelMaxFlow
source: Max Flow: ---
vi: Luồng cực đại: ---

# LabelSupply
source: Supply
vi: Cung

# MsgMoveNode
source: You can move the nodes to make them easier to see...
vi: Bạn có thể di chuyển các node sao cho dễ nhìn hơn...

# NavHome
source: Home
vi: Trang chủ

# NavMaxFlowSimulator
source: Max Flow Simulator
vi: Mô phỏng luồng cực đại

# NavTransportation
source: Transportation Problem
vi: Bài toán vận tải

# OptionAutoBanlance
source: Automatic supply/demand banlance
vi: Tự động cân bằng cung/cầu

# OptionColorByFlow
source: Color by Flow
vi: Tô màu theo dòng chảy

# OptionEnableAimation
source: Enable Animation
vi: Bật hiệu ứng chuyển động

# TextAbout
source: We are a team of students passionate about applying Discrete Mathematics to practical problems. This project focuses on visualizing the Edmonds-Karp (Max Flow) algorithm, allowing users to easily input data, view results, and understand how network flow theory works in practice. The application also demonstrates real-life uses of maximum flow, such as in transportation, logistics, and communication networks, making abstract concepts more accessible and engaging.
vi: Chúng tôi là một nhóm sinh viên đam mê ứng dụng Toán rời rạc vào các bài toán thực tế. Dự án này tập trung vào việc trực quan hóa thuật toán Edmonds-Karp (Dòng chảy cực đại), cho phép người dùng dễ dàng nhập dữ liệu, xem kết quả và hiểu cách lý thuyết dòng chảy mạng hoạt động trong thực tế. Ứng dụng này cũng minh họa các ứng dụng thực tế của dòng chảy cực đại, chẳng hạn như trong giao thông vận tải, hậu cần và mạng lưới truyền thông, giúp các khái niệm trừu tượng trở nên dễ tiếp cận và hấp dẫn hơn.

# titleAboutUs
source: About Us
vi: Giới Thiệu

# TitleExample1
source: Example : 50,40,5
vi: Ví dụ : 50,40,5

# TitleExample2
source: Example :20,10,60
vi: Ví dụ :20,10,60

# TitleExample3
source: Enter a non-negative interger.
vi: Nhập 1 số nguyên không âm

# TitleGroup11
source: GROUP 11
vi: NHÓM 11

# TitleMaxFlow
source: Maximum Flow = --
vi: Luồng cực đại = --
